app/views/users/show.html.erb

SELECT "users".* FROM "users"
---

  <% @user.followed_users.each do |user| %>