app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "content", "user_id", "user_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "111"], ["content", "111"], ["user_id", 1], ["user_name", "yuriko"], ["created_at", "2017-08-17 08:09:19.404911"], ["updated_at", "2017-08-17 08:09:19.404911"]]
---
  def create
    @blog = Blog.new(blogs_params)
    @blog.user_id = current_user.id
    @blog.user_name = current_user.name
    if @blog.save

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "notifications" SET "read" = $1, "updated_at" = $2 WHERE "notifications"."id" = $3  [["read", "t"], ["updated_at", "2017-10-11 02:50:56.175772"], ["id", 6]]
---
  def show
    @comment = @blog.comments.build
    @comments = @blog.comments
    # ヘッダーの通知がリアルタイム
    Notification.find(params[:notification_id]).update(read: true) if params[:notification_id]