app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "email", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "zzz"], ["email", 0], ["content", "zzz"], ["created_at", "2017-08-19 05:30:42.752308"], ["updated_at", "2017-08-19 05:30:42.752308"]]
---
  def create
     @contact = Contact.create(contact_params)