app/controllers/conversations_controller.rb

  def index
   @users = User.all
   @conversations = Conversation.all
---
SELECT "conversations".* FROM "conversations"

  def create
  	#該当のユーザ間での会話が過去に存在しているかを確認する式です
   if Conversation.between(params[:sender_id], params[:recipient_id]).present?
    #その会話を取得
    #betweenメソッドについては、後でモデルに定義します。

    @conversation = Conversation.between(params[:sender_id], params[:recipient_id]).first
    else
    	#過去に一件も存在しなかった場合、
    	#強制的にメッセージを生成
    	#そのためにストロングパラメータconversasion_paramsを使います。
     @conversation = Conversation.create!(conversation_params)
---
SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.recipient_id ='1') OR (conversations.sender_id = '1' AND  conversations.recipient_id ='2'))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" = 2 AND "conversations"."recipient_id" = 1) LIMIT 1
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 2], ["recipient_id", 1], ["created_at", "2017-10-09 02:52:13.887815"], ["updated_at", "2017-10-09 02:52:13.887815"]]