app/controllers/messages_controller.rb

  def index
  	#会話にひもづくメッセージを取得する

  	@messages = @conversation.messages
  	#もしメッセージの数が10よりも大きければ、10より大きいというフラグを有効にしてメッセージを最新の10に絞ることをする

  if @messages.length > 10
---
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]

  def create
  	#HTTPリクエスト上のパラメータを利用して会話にひもづくメッセージを生成

   @message = @conversation.messages.build(message_params)
   #保存ができれば、会話にひもづくメッセージ一覧の画面に遷移する

  if @message.save
---
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", ""], ["user_id", 2], ["conversation_id", 1], ["created_at", "2017-10-09 10:08:17.466059"], ["updated_at", "2017-10-09 10:08:17.466059"]]