app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
  	@users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "users".* FROM "users"